# Data Checking

overview of the data and make it less

In [17]:
# http://rasbt.github.io/mlxtend/user_guide/frequent_patterns/apriori/
# https://medium.com/analytics-vidhya/association-analysis-in-python-2b955d0180c
# https://medium.com/@deepak.r.poojari/apriori-algorithm-in-python-recommendation-engine-5ba89bd1a6da
# https://www.geeksforgeeks.org/implementing-apriori-algorithm-in-python/

In [1]:
import pandas as pd
import os
import prefixspan
from mlxtend.frequent_patterns import apriori

In [2]:
PATH_FILES='../data/raw/instacart-market-basket-analysis/'

## Get The Data

'reordered' indicates that the customer has a previous order that contains the product.

In [5]:
## Priors
fn_priors=[fn for fn in os.listdir(PATH_FILES) if 'order_products__prior_' in fn]
df_prior=pd.concat([pd.read_csv(PATH_FILES+fn) for fn in fn_priors])


## Order Explain
fn_orders=[fn for fn in os.listdir(PATH_FILES) if 'orders_' in fn]
df_order=pd.concat([pd.read_csv(PATH_FILES+fn) for fn in fn_orders])

## Products
df_product=pd.read_csv(PATH_FILES+'products.csv')

## aisle
df_ais=pd.read_csv(PATH_FILES+'aisles.csv')

## Departemen
df_dept=pd.read_csv(PATH_FILES+'departments.csv')

In [6]:
df_prior.shape

(32434489, 4)

In [7]:
df_prior

         order_id  product_id  add_to_cart_order  reordered
0               2       33120                  1          1
1               2       28985                  2          1
2               2        9327                  3          0
3               2       45918                  4          1
4               2       30035                  5          0
...           ...         ...                ...        ...
2734484   3421083       39678                  6          1
2734485   3421083       11352                  7          0
2734486   3421083        4600                  8          0
2734487   3421083       24852                  9          1
2734488   3421083        5020                 10          1

[32434489 rows x 4 columns]

In [8]:
df_order.shape

(3421083, 7)

In [9]:
df_order.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [10]:
df_product.shape

(49688, 4)

In [11]:
df_product.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [12]:
df_ais.shape

(134, 2)

In [13]:
df_ais.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [14]:
df_dept.shape

(21, 2)

In [15]:
df_dept.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

## Do Association Rule

Planning :

1. Suggest Random Recommendation, Given Basket
2. Suggest Random Recommendation based on department_id, Given Basket
3. Suggest Recommendation use Apriori, Given Basket